/*-----------------------------------------------------
	T0.h (v1.00)
	
	header file for T0.c
-----------------------------------------------------*/

#ifndef _T0_H
#define _T0_H

//-----public constants-------------------------------

#define timer0H 0xfb  //设置定时器的时间，公式65536-timer*FOSC/12，然后来进行填充
#define timer0L 0x9b  //现在这个设置在13.5M的晶振下为1ms

//-----public function prototype----------------------

void InitT0();//初始化定时器0

#endif
											
/*---------------------------------------------------
	end of file
----------------------------------------------------*/



